In [9]:
import sqlalchemy as sa
import pandas as pd
import sqlite3

In [3]:
engine = sa.create_engine(
  'sqlite:///../data/beat.db', echo=True)
sa_connection = engine.connect()

2022-12-13 13:56:55,989 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2022-12-13 13:56:55,991 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:56:55,993 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2022-12-13 13:56:55,994 INFO sqlalchemy.engine.base.Engine ()

In [6]:
beat = pd.read_sql('Band', sa_connection, index_col='id')
beat

2022-12-13 13:57:40,063 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("Band")
2022-12-13 13:57:40,064 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,068 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 13:57:40,068 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,077 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_xinfo("Band")
2022-12-13 13:57:40,080 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,084 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2022-12-13 13:57:40,086 INFO sqlalchemy.engine.base.Engine ('Band',)
2022-12-13 13:57:40,092 INFO sqlalchemy.engine.base.Engine PRAGMA main.foreign_key_list("Band")
2022-12-13 13:57:40,096 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,099 INFO sqlalchemy.engine.base.Engine PRAGMA temp.foreign_key_list("Band")
2022-12-13 13:57:40,101 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,102 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2022-12-13 13:57:40,104 INFO sqlalchemy.engine.base.Engine ('Band',)
2022-12-13 13:57:40,106 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("Band")
2022-12-13 13:57:40,112 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,116 INFO sqlalchemy.engine.base.Engine PRAGMA temp.index_list("Band")
2022-12-13 13:57:40,119 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,120 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("Band")
2022-12-13 13:57:40,121 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,126 INFO sqlalchemy.engine.base.Engine PRAGMA temp.index_list("Band")
2022-12-13 13:57:40,133 INFO sqlalchemy.engine.base.Engine ()
2022-12-13 13:57:40,135 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2022-12-13 13:57:40,137 INFO sqlalchemy.engine.base.Engine ('Band',)
2022-12-13 13:57:40,143 INFO sqlalchemy.engine.base.Engine SELECT "Band".id, "Band".fname, "Band".lname, "Band".birthyear
FROM "Band"
2022-12-13 13:57:40,145 INFO sqlalchemy.engine.base.Engine ()

   fname      lname  birthyear
id
0   Paul  McCartney       1942
1   John     Lennon       1940

In [10]:
con = sqlite3.connect('../data/beat.db')
sql = '''SELECT fname, birthyear from Band'''
fnames = pd.read_sql(sql, con)
fnames

  fname  birthyear
0  Paul       1942
1  John       1940